src/Documents/Scan_СпецификацияСтандартнойМодели/Scan_СпецификацияСтандартнойМодели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_СпецификацияСтандартнойМодели</name>
  <attributes>
    <name>ДействуетСДаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетСPP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСпецификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеСпецификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВРазделеКалькуляции</name>
    <type>
      <types>CatalogRef.Scan_РазделыКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикНадстроек</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикОборудования</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВКалькуляции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Scan_СтатусыЗаявокНаДействие</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторнирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SOrder</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>FFU</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Scan_МоделиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаАннулирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяСебестоимостьСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.Scan_ОпцииПродуктов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НезагруженныеОпции</name>
    <attributes>
      <name>Исполнение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Надстройки</name>
    <attributes>
      <name>НоменклатураНадстроек</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>НоменклатураНадстроек</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Scan_ХарактеристикиSTD/Scan_ХарактеристикиSTD.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ХарактеристикиSTD</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>CatalogRef.Scan_СтатусыЗаявокНаДействие</types>
      <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
      <types>CatalogRef.Scan_РазделыКалькуляции</types>
      <types>Boolean</types>
      <types>CatalogRef.Scan_МоделиПродуктов</types>
      <types>CatalogRef.Scan_Контрагенты</types>
      <types>String</types>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗначения</name>
    <type>
      <types>EnumRef.Scan_ДополнительнаяИнформацияПоSTD</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_ДополнительнаяИнформацияПоSTD/Scan_ДополнительнаяИнформацияПоSTD.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ДополнительнаяИнформацияПоSTD</name>
  <enumValues>
    <name>ДействуетСДаты</name>
  </enumValues>
  <enumValues>
    <name>ДействуетСPP</name>
  </enumValues>
  <enumValues>
    <name>ДокументОснование</name>
  </enumValues>
  <enumValues>
    <name>НомерСпецификации</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеСпецификации</name>
  </enumValues>
  <enumValues>
    <name>ИспользуетсяВРазделеКалькуляции</name>
  </enumValues>
  <enumValues>
    <name>ПоставщикНадстроек</name>
  </enumValues>
  <enumValues>
    <name>ПоставщикОборудования</name>
  </enumValues>
  <enumValues>
    <name>ИспользуетсяВКалькуляции</name>
  </enumValues>
  <enumValues>
    <name>Статус</name>
  </enumValues>
  <enumValues>
    <name>Сторнирован</name>
  </enumValues>
  <enumValues>
    <name>SOrder</name>
  </enumValues>
  <enumValues>
    <name>FFU</name>
  </enumValues>
  <enumValues>
    <name>Модель</name>
  </enumValues>
  <enumValues>
    <name>ПричинаАннулирования</name>
  </enumValues>
  <enumValues>
    <name>ПлановаяСебестоимостьСНДС</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Scan_СтатусыЗаявокНаДействие/Scan_СтатусыЗаявокНаДействие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СтатусыЗаявокНаДействие</name>
  <predefined>
    <items>
      <name>Аннулирована</name>
      <description>Аннулирована</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>ДоставкаЗавершена</name>
      <description>Доставка завершена</description>
    </items>
    <items>
      <name>ЗаявкаОтправлена</name>
      <description>Заявка отправлена</description>
    </items>
    <items>
      <name>Исполнена</name>
      <description>Исполнена</description>
    </items>
    <items>
      <name>Новая</name>
      <description>Новая</description>
    </items>
    <items>
      <name>Отклонена</name>
      <description>Отклонена</description>
    </items>
    <items>
      <name>Подтверждена</name>
      <description>Подтверждена</description>
    </items>
  </predefined>
  <attributes>
    <name>НедоступноДляВыбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядок сортировки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <comment>Цвет заказ-наряда в журналах</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекста</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Шрифт</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/Scan_СпецификацияСтандартнойМодели/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Перем ИзмРекв;

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	МенеджерНовый = ПользователиКлиентСервер.ТекущийПользователь();
	Если МенеджерНовый <> Менеджер Тогда
		Менеджер = МенеджерНовый;
		Организация = МенеджерНовый.Организация;
		ПодразделениеКомпании = МенеджерНовый.ПодразделениеОрганизации;
	КонецЕсли;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ?(ЭтотОбъект.ЭтоНовый(), ИСТИНА, ЛОЖЬ));
	
	ИзмРекв = Новый Массив;
	//Если новый - запишем заполненные реквизиты
	Если ЭтотОбъект.ЭтоНовый() тогда
		Для каждого Рекв из ЭтотОбъект.Метаданные().Реквизиты Цикл
			Если ТипЗнч(ЭтотОбъект[Рекв.Имя]) = Тип("Булево") и ЭтотОбъект[Рекв.Имя] = Ложь Тогда
				Продолжить;
			ИначеЕсли Не ЗначениеЗаполнено(ЭтотОбъект[Рекв.Имя]) Тогда
				Продолжить;
			ИначеЕсли ТипЗнч(ЭтотОбъект[Рекв.Имя]) = Тип("ХранилищеЗначения") Тогда
				Продолжить;
			КонецЕсли;
			ИзмРекв.Добавить(Рекв.Имя);
		КонецЦикла;
	Иначе  //если не новый - то измененные
		Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("НеЗаписыватьВРегистр") Тогда 
			Для каждого Рекв из ЭтотОбъект.Метаданные().Реквизиты Цикл
				Если  (ЭтотОбъект[Рекв.Имя] <> ссылка[Рекв.Имя])
					И ТипЗнч(ЭтотОбъект[Рекв.Имя]) <> Тип("ХранилищеЗначения")
					Тогда
					ИзмРекв.Добавить(Рекв.Имя);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	//для старых объектов, у которых нет данных в регистре - запишем заполненные
	Если ИзмРекв.Количество() = 0 И НетИсторииВРегистре(Ссылка) Тогда
		Для каждого Рекв из ЭтотОбъект.Метаданные().Реквизиты Цикл
			Если ТипЗнч(ЭтотОбъект[Рекв.Имя]) = Тип("Булево") и ЭтотОбъект[Рекв.Имя] = Ложь Тогда
				Продолжить;
			ИначеЕсли Не ЗначениеЗаполнено(ЭтотОбъект[Рекв.Имя]) Тогда
				Продолжить;
			ИначеЕсли ТипЗнч(ЭтотОбъект[Рекв.Имя]) = Тип("ХранилищеЗначения") Тогда
				Продолжить;
			КонецЕсли;
			ИзмРекв.Добавить(Рекв.Имя);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Scan_СпецификацияСтандартнойМодели") Тогда
		// На основании док-та спецификации создается только корректировка
		
		ИспользуетсяВРазделеКалькуляции = ДанныеЗаполнения.ИспользуетсяВРазделеКалькуляции; 
		НомерСпецификации = ДанныеЗаполнения.НомерСпецификации;
		ДействуетСPP = ДанныеЗаполнения.ДействуетСPP;
		ДействуетСДаты = ДанныеЗаполнения.ДействуетСДаты;
		ОписаниеСпецификации  = ДанныеЗаполнения.ОписаниеСпецификации;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		SOrder = ДанныеЗаполнения.SOrder;
		FFU = ДанныеЗаполнения.FFU;
		ПоставщикНадстроек = ДанныеЗаполнения.ПоставщикНадстроек;
		ПоставщикОборудования = ДанныеЗаполнения.ПоставщикОборудования;

		ДатаСоздания = ТекущаяДата();
		Статус = Справочники.Scan_СтатусыЗаявокНаДействие.Новая;
		Корректировка = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) //rarus bonmak 26.03.2020 15466 ++
	
	// rarus agar 26.04.2021 17394 ++
	УдаляемыйРеквизит = ПроверяемыеРеквизиты.Найти("ИспользуетсяВРазделеКалькуляции");
	Если Не ИспользуетсяВКалькуляции 
		И   УдаляемыйРеквизит <> Неопределено 
		Тогда
		ПроверяемыеРеквизиты.Удалить(УдаляемыйРеквизит);
	КонецЕсли;
	// rarus agar 26.04.2021 17394 --
	
	// Проверим заполненность реквизитов
	ТекРеквизит = ПроверяемыеРеквизиты.Найти("ИспользуетсяВРазделеКалькуляции");
	Если Не ЗначениеЗаполнено(ИспользуетсяВРазделеКалькуляции) 
		И   ТекРеквизит <> Неопределено // rarus agar 26.04.2021 17394 +-
		Тогда
		
		// Если он не заполнен, сообщим об этом пользователю
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Поле ""Раздел калькуляции"" не заполнено';
				|en = 'Field ""Costing section"" is empty'");
		Сообщение.Поле = "ИспользуетсяВРазделеКалькуляции";
		Сообщение.УстановитьДанные(ЭтотОбъект);	
		Сообщение.Сообщить();	
		ПроверяемыеРеквизиты.Удалить(ТекРеквизит);
		Отказ = Истина;
	КонецЕсли;
	
	ТекРеквизит = ПроверяемыеРеквизиты.Найти("НомерСпецификации");
	Если Не ЗначениеЗаполнено(НомерСпецификации) Тогда
		
		// Если он не заполнен, сообщим об этом пользователю
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Поле ""№"" не заполнено';
				|en = 'Field ""№"" is empty'");
		Сообщение.Поле = "НомерСпецификации";
		Сообщение.УстановитьДанные(ЭтотОбъект);	
		Сообщение.Сообщить();	
		ПроверяемыеРеквизиты.Удалить(ТекРеквизит);
		Отказ = Истина;
	КонецЕсли;
	
	ТекРеквизит = ПроверяемыеРеквизиты.Найти("ДействуетСДаты");
	Если Не ЗначениеЗаполнено(ДействуетСДаты) Тогда
		
		// Если он не заполнен, сообщим об этом пользователю
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Поле ""Действует с даты"" не заполнено';
				|en = 'Field ""Valid from date"" is empty'");
		Сообщение.Поле = "ДействуетСДаты";
		Сообщение.УстановитьДанные(ЭтотОбъект);	
		Сообщение.Сообщить();	
		ПроверяемыеРеквизиты.Удалить(ТекРеквизит);
		Отказ = Истина;
	КонецЕсли;
	
	ТекРеквизит = ПроверяемыеРеквизиты.Найти("ОписаниеСпецификации");
	Если Не ЗначениеЗаполнено(ОписаниеСпецификации) Тогда
		
		// Если он не заполнен, сообщим об этом пользователю
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Поле ""Описание"" не заполнено';
				|en = 'Field ""Description"" is empty'");
		Сообщение.Поле = "ОписаниеСпецификации";
		Сообщение.УстановитьДанные(ЭтотОбъект);	
		Сообщение.Сообщить();	
		ПроверяемыеРеквизиты.Удалить(ТекРеквизит);
		Отказ = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДействуетСPP) Тогда 
		Отказ = Отказ Или РегистрыСведений.Scan_ИнформацияПоPartPeriod.ПроверитьПартПериод(ДействуетСPP);
		Если Отказ Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//rarus agar 14.05.2020  15466 Доп1 ++
	Если  ЗначениеЗаполнено(ДействуетСДаты)
		И ЗначениеЗаполнено(ДействуетСPP)
		И Не Scan_ЦенообразованиеСервер.ДатаСоответствуетPartPeriod(ДействуетСДаты, ДействуетСPP) 
		Тогда
		Сообщить(НСтр("ru = 'Указанный Part Period не соответствует дате начала действия'; en = 'The Part Period does not match the From Date'"));
		Отказ = Истина;
	КонецЕсли;
	//rarus agar 14.05.2020  15466 Доп1 --
	
	//rarus agar 13.05.2020 15466 Доп1 ++
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СпецификацияСсылка", Ссылка);
	Запрос.УстановитьПараметр("НомерСпецификации",  СокрЛП(НомерСпецификации));
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Scan_СпецификацияСтандартнойМодели.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Scan_СпецификацияСтандартнойМодели КАК Scan_СпецификацияСтандартнойМодели
	|ГДЕ
	|	Scan_СпецификацияСтандартнойМодели.Ссылка <> &СпецификацияСсылка
	|	И Scan_СпецификацияСтандартнойМодели.НомерСпецификации = &НомерСпецификации
	|	И Scan_СпецификацияСтандартнойМодели.Статус = ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.ВРаботе)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Спецификация стандартной модели с таким номером и статусом В работе уже существует';
				               |en = 'STD with the same number is already exists'");
		Сообщение.Поле = "НомерСпецификации";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	//rarus agar 13.05.2020 15466 Доп1 --
	
	// rarus agar 26.04.2021 17394 ++
	Если  ИспользуетсяВКалькуляции 
		И Спецификация.Количество() = 0
		Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Не заполнена спецификация (базовые опции)';
				               |en = 'Basic options table is empty'");
		Сообщение.Поле = "Спецификация";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	// rarus agar 26.04.2021 17394 --
	
КонецПроцедуры //rarus bonmak 26.03.2020 15466 --

Процедура ПриЗаписи(Отказ)
	
	Если Не Отказ Тогда
		АвторизованныйПользователь = ПользователиСлужебный.АвторизованныйПользователь();
		Для Каждого Реквизит Из ИзмРекв Цикл
			НоваяЗапись = РегистрыСведений.Scan_ХарактеристикиSTD.СоздатьМенеджерЗаписи();
			НоваяЗапись.Период = ТекущаяДата();
			НоваяЗапись.Спецификация = Ссылка;
			НоваяЗапись.ВидЗначения  = Перечисления.Scan_ДополнительнаяИнформацияПоSTD[Реквизит];
			НоваяЗапись.Значение     = Ссылка[Реквизит];
			НоваяЗапись.Пользователь = АвторизованныйПользователь;
			НоваяЗапись.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

//rarus agar 13.05.2020 15466 Доп1 ++
Процедура ПриКопировании(ОбъектКопирования)
	
	Статус = Справочники.Scan_СтатусыЗаявокНаДействие.Новая;
	
КонецПроцедуры
//rarus agar 13.05.2020 15466 Доп1 --

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НетИсторииВРегистре(Спецификация) 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.Текст = "ВЫБРАТЬ
	|	Scan_ХарактеристикиSTD.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.Scan_ХарактеристикиSTD КАК Scan_ХарактеристикиSTD
	|ГДЕ
	|	Scan_ХарактеристикиSTD.Спецификация = &Спецификация";
	
	Возврат Запрос.Выполнить().Выбрать().Количество() = 0;
	
КонецФункции

#КонецОбласти

#КонецЕсли
